Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterBase
The serialization structure for AnalysisDesignParameterBase.

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterBase.AnalysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterBase.materialType
The material type of the analysis design parameter.

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterBase.isGeneral
This indicates whether the design parameter is general.

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterBase.name
The name of the analysis design parameter

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterBase.unit
The unit of the analysis design parameter

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterBase.ToStruct(Tekla.Structures.Analysis.AnalysisDesignParameterBase)
DO NOT USE! For internal usage only!
analysisDesignParameter:
The source analysis design parameter

Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterBase.FromStruct(Tekla.Structures.Analysis.AnalysisDesignParameterBase)
DO NOT USE! For internal usage only!
analysisDesignParameter:
The target analysis design parameter